package day6.forex;

public class ForClassNote {
	/* for문 (초기화;조건식;증감식){
	 * 실행문;
	 * }
	 * 초기화 >
	 * 조건식 (참) > 실행문 > 증감식 >
	 * 조건식 (참) > 실행문 > 증감식 >
	 * 조건식 (거짓)> 반복문 종료
	 * -초기화:
	 * for문 실행 시 처음 1번만 실행
	 * 변수를 초기화 하는 곳
	 * 변수 선언도 가능하지만 for문에서만 사용 가능
	 * 생략 가능
	 * 주로 조건식에서 사용하는 변수나 반복문에서 사용하는데 초기값이 필요한 변수를 초기화 함
	 * -조건식:
	 * for문을 이용하여 반복을 할지 말지를 결정
	 * 조건식이 true 이면 반복, false이면 반복문 종료
	 * 조건식이 true 이면 실행문으로 이동
	 * 생략 가능. 생략하면 항상 true
	 * -증감식:
	 * 조건식에서 사용하는 변수를 증가하거나 감소하게 하는 식이 있는 곳
	 * 실행문 료 후 증감식으로 이동
	 * 증감식이 종료 후 조건식으로 이동
	 * 생략 가능
	 * -For VS While:
	 * 언제 어떤 반복문을 사용할지에 대해 정해진 답은 없음: 개인 취향
	 * 강사의 경우
	 * 규칙적으로 증가하는 변수를 이용하여 반복을 한다? for을 이용
	 * 1-10까지 출력하는 예제
	 * 특정 조건을 만족할 때 반복문을 종료한다? while을 이용
	 * q를 입력받을 때까지 문자를 입력받아 출력하는 예제
	 * for문과 while문 중 더 잘 사용할 수 있는 방법으로 연습하자!
	 */
}
